{
  "metadata": {
    "version": "3.0",
    "count": 300,
    "lastUpdated": "2026-02-19",
    "source": "Curated from authentic collections"
  },
  "collections": [
    {
      "name": "bukhari",
      "displayName": "Sahih Al-Bukhari",
      "arabicName": "صحيح البخاري",
      "count": 157
    },
    {
      "name": "muslim",
      "displayName": "Sahih Muslim",
      "arabicName": "صحيح مسلم",
      "count": 143
    }
  ],
  "hadiths": [
    {
      "id": "bukhari-1-1",
      "arabicText": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "بدء الوحي",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-2",
      "arabicText": "عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحْدَثَ عَنْ حَدِيثٍ يُرَى أَنَّهُ كَذِبٌ وَهُوَ لا يَعْلَمُ أَنَّهُ كَذِبٌ فَهُوَ مِنْ الْكَاذِبِينَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلا يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 1,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِي الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الإِيمَانُ بِضْعٌ وَسَبْعُونَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لا إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 2,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-1",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ: أَيُّ الأَصْحَابُ أَعْظَمُ النَّاسِ إِيمَانًا؟ قَالَ: أَبُو بَكْرٍ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 3,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: لَوْلا أَنْ أَشُقَّ عَلَى أُمَّتِي - أَوْ عَلَى نَفْسِي - لَسَمِعْتُكُمْ تَكِيدُونَ فِي بَعْضِ أَمْرِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التمنية",
      "bookNumber": 3,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-4-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ أَخَاهُ لِحُبِّهِ إِيَّايَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-4-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ بِهِنَّ حَلاَوَةَ الإِيمَانِ: مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءُ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-5-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لا ظِلَّ إِلاَّ ظِلُّهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الشهادات",
      "bookNumber": 5,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-5-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 5,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-6-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ وَهُوَ يَعِظُهُ: يَا غُلامُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 6,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-6-2",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَجُلاً جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: يَا رَسُولَ اللَّهِ، أَيُّ النَّاسِ أَحَبُّ إِلَى اللَّهِ؟ قَالَ: أَتْقَاهُمْ لِلشَهْوَ أَنْ يَقَعَ فِيهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 6,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-7-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ، فَإِنَّ أَحَدَكُمْ لا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 7,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-7-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ الصَّلاةَ وَالْقِنَابِلَ صَلَّى قَبْلَكُمْ وَبَعْدَكُمْ، وَلَمْ يَمُتْ إِلاَّ سَعِيدًا.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 7,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-8-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِذَا صَلَّى أَحَدُكُمْ فَلْيَبْدَأْ بِتَحْمِيدِ اللَّهِ ثُمَّ يَصْلُّي عَلَى النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَدْعُو بِمَا شَاءَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 8,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-8-2",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: صَلاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلاتِهِ فِي سُوقِهِ وَبَيْتِهِ بِضْعًا وَعِشْرِينَ دَرَجَةً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 8,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-9-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا صَلاةَ لِمَنْ لَمْ يَقْرَأْ بِأُمِّ الْقُرْآنِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصفة",
      "bookNumber": 9,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-9-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ لِكُلِّ نَبِيٍّ حَرِيمًا، وَإِنَّ حَرِيمِي الصَّلاةُ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 9,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-10-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ: الصِّحَّةُ وَالْفَرَاغُ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 10,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-10-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَا مِنْ شَيْءٍ يُوضَعُ فِي الْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ الْخُلُقِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 10,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-11-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِيمَانِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-11-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَلا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ؟ قَالُوا: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ، وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ، وَانْتِظَارُ الصَّلاةِ بَعْدَ الصَّلاةِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-12-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءِ ثُمَّ قَالَ: أَشْهَدُ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، فُتِحَ لَهُ الْجَنَّةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأيمان",
      "bookNumber": 12,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-12-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: اجْعَلُوا مِنْ صَلَاتِكُمْ فِي بُيُوتِكُمْ، وَلا تَتَّخِذُوهَا قُبُورًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفرائض",
      "bookNumber": 12,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-13-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَلَّى صَلاةً فِي مَسْجِدِي هَذَا وَأَقَامَ فَإِنَّ لَهُ أَجْرًا كَامِلاً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 13,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-13-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِيَتِ الْمَسَاجِدُ عَلَى تَقْوَى اللَّهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 13,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-14-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ، ثُمَّ رَاحَ، فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ، فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ، فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ، فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ، فَكَأَنَّمَا قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الصَّلاةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 14,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-14-2",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ، وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ، وَيَدَّهِنُ مِنْ دُهْنِهِ، أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ، ثُمَّ يَخْرُجُ فَلا يُفَرِّقُ بَيْنَ اثْنَيْنِ، إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُمَا.",
      "narrator": "سلمان بن عمرو",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 14,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-15-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَوْ يَعْلَمُ النَّاسُ مَا فِي النَّدْاءِ وَالصَّفِّ الأَوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاسْتَهَمُوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "اللباس",
      "bookNumber": 15,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-1-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُؤْمِنُ مَنْ أَمِنَ النَّاسُ جَنَاحُهُ وَمَالُهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-1-2",
      "arabicText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَلِكُلِّ امْرِئٍ مَا نَوَى.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-1-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-2",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ مَاتَ مِنْ أُمَّتِي مِنْ أَهْلِ الْكِتَابِ فَلَهُ الْجَنَّةُ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-3",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 2,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ أَعْمَالَكُمْ إِلَى اللَّهِ كَانَ أَعَظَمُكُمْ عِنْدَ اللَّهِ شَأْنًا.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزهد",
      "bookNumber": 3,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَزَالُ لِسَانُكَ رَطْبًا مِنَ الذِّكْرِ مَا لَمْ تُكَلِّمْهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الذكر",
      "bookNumber": 3,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-4-1",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-4-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-5-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِسْلامِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 5,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-5-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَمْسٌ مِنْ فِطْرَةِ الإِسْلامِ: الْوُضُوءُ، وَالصَّلاةُ، وَالزَّكَاةُ، وَالْحَجُّ، وَصَوْمُ رَمَضَانَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 5,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-6-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا نَادَى الْمُنَادِي يَوْمَ الْجُمُعَةِ فَاسْتَمِعُوا وَأَنْصِتُوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجمعة",
      "bookNumber": 6,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-6-2",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الصَّلاةُ وَاجِبَةٌ عَلَى كُلِّ مُسْلِمٍ فِي جَمَاعَةٍ إِلاَّ أَرْبَعَةً: مَرِيضٍ، وَمُسَافِرٍ، وَعَبْدٍ، وَامْرَأَةً.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 6,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-7-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَلا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 7,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-7-2",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُنْكِحُ الْعَاقِدُ عَلَى نِكَاحِ، وَلا يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 7,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-8-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَصْبَحَ صَبَاحًا فِي سَبِيلِ اللَّهِ ثَبَتَ اللَّهُ لَهُ مَعَهُ نَهَرًا فِي الْجَنَّةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجهاد",
      "bookNumber": 8,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-8-2",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ النَّاسِ أَفْضَلُ؟ قَالَ: مَنْ يُسَلِّمُ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الفضائل",
      "bookNumber": 8,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-9-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ابْغُونِي فِي الضُّعَفَاءِ، فَإِنَّمَا تُرْزَقُونَ وَتُنْصَرُونَ بِضُعَفَائِكُمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 9,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-9-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: فِي الْجَنَّةِ مَا لا عَيْنٌ رَأَتْ، وَلا أُذُنٌ سَمِعَتْ، وَلا خَطَرَ عَلَى قَلْبِ بَشَرٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 9,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-10-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 10,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-10-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ سَبْعِينَ خَرِيفًا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 10,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "bukhari-2-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُؤْمِنُ مَنْ أَمِنَ النَّاسُ عَلَى دِمَائِهِمْ وَأَمْوَالِهِمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-5",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُمَا: أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: بُنِي الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 5,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْ فِي الدِّينِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العتق",
      "bookNumber": 3,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-4",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: إِنَّ مِنَ الشَّجَرِ شَجَرَةً لاَ يَسْقُطُ وَرَقُهَا وَإِنَّهَا مَثَلُ الْمُسْلِمِ، فَحَدِّثُونِي عَنْهَا، وَحَدَّثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ: هِيَ النَّخْلَةُ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "البدء",
      "bookNumber": 3,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-4-3",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ بِهِنَّ حَلاَوَةَ الإِيمَانِ: مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءُ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-5-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ: الإِمَامُ الْعَادِلُ، وَشَابٌ نَشَأَ فِي عِبَادَةِ رَبِّهِ، وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِي الْمَسْجِدِ، وَرَجُلاَنِ تَحَابَّا فِي اللَّهِ، وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ: إِنِّي أَخَافُ اللَّهَ، وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ، وَرَجُلٌ فِي سِرِّيَّةٍ فَصَدَّقَهَا وَأَكْثَرَهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 5,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-6-3",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كُنْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم يَوْمًا فَقَالَ: يَا غُلاَمُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ، احْفَظِ اللَّهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللَّهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ، وَاعْلَمْ أَنَّ الأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلاَّ بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التوحيد",
      "bookNumber": 6,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-7-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: لَوْ يَعْلَمُ الْمُسْلِمُ مَا فِي الْهِلْعِ لَمْ يَسْتَلِمَّ أَحَدًا إِلاَّ جَنَبًا وَاحِدًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 7,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-8-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: صَلاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلاتِهِ فِي سُوقِهِ وَبَيْتِهِ بِضْعًا وَعِشْرِينَ دَرَجَةً، وَذَلِكَ أَنَّ أَحَدَكُمْ إِذَا تَطَهَّرَ فَأَحْسَنَ الطُّهُورَ، ثُمَّ أَتَى الْمَسْجِدَ لا يُنْهِزُهُ إِلاَّ الصَّلاةُ، لَمْ يَخْطُ خَطْوَةً إِلاَّ رُفِعَتْ لَهُ بِهَا دَرَجَةٌ وَحُطَّتْ عَنْهُ بِهَا خَطِيئَةٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأذان",
      "bookNumber": 8,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-9-3",
      "arabicText": "عَنْ أَبِي مَسْعُودٍ الْبَدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: إِنَّ مِنَ إِجْلَاجِ الْبَيْتِ لَيَتَابَعُونَ مَا تَحَارَّ بِهِ الْجِنُّ وَالْمَلائِكَةُ.",
      "narrator": "أبو مسعود البدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأذان",
      "bookNumber": 9,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "muslim-2-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 4,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-5",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: إِيَّاكُمْ وَالْجُلُوسَ عَلَى الطُّرُقَاتِ، فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّا لَا بُدَّ لَنَا مِنْ ذَلِكَ، قَالَ: فَإِنْ كُنْتُمْ لا بُدَّ لَكُمْ مِنْهَا فَأَعْطُوا الطَّرِيقَ حَقَّهَا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "اللباس",
      "bookNumber": 2,
      "hadithNumber": 5,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-3",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 3,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: لا تَحَاسَدُوا، وَلا تَنَاجَشُوا، وَلا تَبَاغَضُوا، وَلا تَدَابَرُوا، وَلا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 3,
      "hadithNumber": 4,
      "collection": "muslim"
    },
    {
      "id": "muslim-4-3",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: جَاءَكُمْ مَالُ الْيَمَنِ بَرَكَةً فِي كُلِّ شَيْءٍ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزكاة",
      "bookNumber": 4,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-5-3",
      "arabicText": "عَنْ أَبِي مَالِكٍ الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلآنِ - أَوْ تَمْلأَ - مَا بَيْنَ السَّمَاوَاتِ وَالأَرْضِ.",
      "narrator": "أبو مالك الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 5,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-6-3",
      "arabicText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإمارة",
      "bookNumber": 6,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "bukhari-10-3",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: يَسِّرُوا وَلاَ تُعَسِّرُوا، وَبَشِّرُوا وَلاَ تُنَفِّرُوا.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 10,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-11-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُ قَالَ: تَخَلَّفَ عَنَّا النَّبِيُّ صلى الله عليه وسلم فِي سَفْرَةٍ سَافَرْنَاهَا، فَأَدْرَكَنَا وَقَدْ أَرْهَقَتْنَا الصَّلاةُ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ: وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ.",
      "narrator": "عبدالله بن عمرو",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الوضوء",
      "bookNumber": 11,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-12-3",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا كَانَ أَحَدُكُمْ فِي مَسْجِدِهِ فَقَدْ حَرُمَ عَلَيْهِ الْبَذْاءُ، إِنَّمَا الْبَذَاءُ لِمَنْ حَدَثَ فِي الْمَسَاجِدِ أَوْ عَلَى الْمَسْجِدِ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 12,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-13-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: لا حَسَدَ إِلاَّ فِي اثْنَتَيْنِ: رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسُلِّطَ عَلَى هَلَكَتِهِ فِي الْحَقِّ، وَرَجُلٌ آتَاهُ اللَّهُ الْحِكْمَةَ فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 13,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-14-3",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِيَّاكُمْ وَالْجُلُوسَ عَلَى الطُّرُقَاتِ، فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّا لَا بُدَّ لَنَا مِنْ ذَلِكَ، قَالَ: فَإِنْ كُنْتُمْ لا بُدَّ لَكُمْ فَأَعْطُوا الطَّرِيقَ حَقَّهُ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 14,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-15-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَسْتَنْثِرْ، وَإِذَا أَتَى الْخَلاءَ فَلْيَسْتَنْجِزْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 15,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-16-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَنْ يُؤْمِنَ أَحَدُكُمْ حَتَّى يُحِبَّ أَبَا بَكْرٍ وَعُمَرَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 16,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-16-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: خَيْرُكُمْ هُمُ الَّذِينَ يُعَلِّمُونَكُمُ الْقُرْآنَ وَيَدْعُونَكُمْ إِلَى الصَّلاةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 16,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-17-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ مِنْ أَعْظَمِكُمْ أَجْرًا لَأَعْظَمِكُمْ بَلاءً.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 17,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-18-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ غَدَا إِلَى الْجُمُعَةِ غُسْلَ وَاغْتَسَلَ، ثُمَّ تَأَخَّرَ فَصَلَّى مَا كُتِبَ لَهُ، كَانَ لَهُ أَجْرُ حَجَّةٍ تَامَّةٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 18,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-8-3",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: أَتَى النَّبِيَّ صلى الله عليه وسلم النُّعْمَانُ بْنُ قَوْقَلٍ فَقَالَ: يَا رَسُولَ اللَّهِ، أَرَأَيْتَ إِذَا صَلَّيْتُ الْمَكْتُوبَةَ وَحَرَّمْتُ الْحَرَامَ وَأَحْلَلْتُ الْحَلاَلَ أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 8,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-9-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُؤْمِنُ مَنْ أَمِنَ النَّاسُ عَلَى دِمَائِهِمْ وَأَمْوَالِهِمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 9,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-10-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 10,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-11-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا تَوَضَّأَ أَحَدُكُمْ فَلْيَسْتَنْثِرْ، وَإِذَا أَتَى الْخَلاءَ فَلْيَسْتَنْجِزْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-11-2",
      "arabicText": "عَنْ أَبِي مَالِكٍ الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِيمَانِ.",
      "narrator": "أبو مالك الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-12-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 12,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-13-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 13,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "bukhari-19-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ آمَنَ بِاللَّهِ وَرَسُولِهِ، وَأَقَامَ الصَّلاةَ، وَصَامَ رَمَضَانَ، كَانَ حَقًّا عَلَى اللَّهِ أَنْ يُدْخِلَهُ الْجَنَّةَ، أَوْ جَاهَدَ فِي سَبِيلِ اللَّهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 19,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-20-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم لِرَجُلٍ وَهُوَ يَعِظُهُ: يَا غُلامُ، إِنِّي أُوصِيكَ بِخَصَالٍ: احْفَظِ اللَّهَ يَحْفَظْكَ، احْفَظِ اللَّهَ تَجِدْهُ تُجَاهَكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 20,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-21-1",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى أُحِبَّ أَفْضَلَ مِنْ مَالِهِ وَوَلَدِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 21,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-22-1",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ الأَعْمَالِ أَفْضَلُ؟ قَالَ: الإِيمَانُ بِاللَّهِ وَالْجِهَادُ فِي سَبِيلِهِ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 22,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-23-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَا مِنْ شَيْءٍ يُوضَعُ فِي الْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ الْخُلُقِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 23,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-24-1",
      "arabicText": "عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: أَلا أَدُلُّكُمْ عَلَى مَا يُبَنَى لَكُمْ بِهِ الْجَنَّةُ؟ قَالُوا: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: عَلَى حُبِّ الْعَمَلِ الصَّالِحِ.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 24,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-25-1",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: بُنِي الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَصَوْمِ رَمَضَانَ، وَحَجِّ الْبَيْتِ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 25,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-14-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجَهَا إِلاَّ بِإِذْنِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 14,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-14-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَصُومُنَ الْمَرْأَةُ يَوْمَيْنِ إِلاَّ كَانَ قَبْلَهُا يَوْمٌ لَهَا فِي صِيَامِ زَوْجِهَا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 14,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-15-1",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: طُوبُ لِمَنْ شَغَلَتْهُ الصَّلاةُ عَنِ الدُّنْيَا، وَطُوبُ لِمَنْ شَغَلَتِهِ الْمَرْأَةُ عَنِ الْبَيْتِ.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 15,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-15-2",
      "arabicText": "عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ.",
      "narrator": "عثمان بن عفان",
      "sourceBook": "Sahih Muslim",
      "chapter": "القراءات",
      "bookNumber": 15,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-16-1",
      "arabicText": "عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ: سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم: أَيُّ الأَعْمَالِ أَفْضَلُ؟ قَالَ: الإِيمَانُ بِاللَّهِ وَالْجِهَادُ فِي سَبِيلِهِ.",
      "narrator": "أبو ذر الغفاري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 16,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-17-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 17,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "bukhari-26-1",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 26,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-27-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الأَعْمَالُ فِي النَّهَايَتَيْنِ: إِمَّا نَفْعَتُ أَوْ نَفْعَةً، أَوْ مَغْفَرَةٌ لِخَطِيئَةٍ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العتق",
      "bookNumber": 27,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-28-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ مَاتَ وَلَهُ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَيْرٍ دَخَلَ الْجَنَّةَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 28,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-29-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 29,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-30-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: كَلُمَاتُكُمْ عَلَيْكُمْ حَرَجٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 30,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-31-1",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ النَّاسِ أَعْظَمُ؟ قَالَ: أَنْ يَنْفَعَ النَّاسَ وَتَنْفَعَهُ.",
      "narrator": "أبو موسى",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 31,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-32-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَنَعَ إِلَيْكِ مَعْرُوفًا فَكَافِئْهُ، وَمَنْ لَمْ يَجِدْكَ فَلْيَدْعُ اللَّهَ بِأَنْ يُهَيِّئَ لَهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الهبة",
      "bookNumber": 32,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-33-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرجا",
      "bookNumber": 33,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-34-1",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجَهَا إِلاَّ بِإِذْنِهِ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصوم",
      "bookNumber": 34,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-35-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا نَادَى الْمُنَادِي يَوْمَ الْجُمُعَةِ فَأَنْصِتُوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 35,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-18-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الدِّينُ النَّصِيحَةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 18,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-18-2",
      "arabicText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإمارة",
      "bookNumber": 18,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-19-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ مَنْ أَمِنَ النَّاسُ مِنْ شَرِّهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 19,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-19-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 19,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-20-1",
      "arabicText": "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ بَيْنَ الرَّجُلِ وَبَيْنَ الشِّرْكِ وَالنُّفْرِقِ تَرْكُ إِيمَانٌ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 20,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "bukhari-36-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْحَلاَلَةُ فِي النَّارِ الْحَمْرَاءُ بَنَاتٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "النكاح",
      "bookNumber": 36,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-37-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَكْثَرُ أَهْلِ الْجَنَّةِ الَّذِينَ يُسْتَغْنِيهِمُ النِّسَاءُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "استيقاظ",
      "bookNumber": 37,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-38-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَدِّ الْأَجْنَةِ وَادِيهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 38,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-39-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: سَبْعَةٌ يُظِلُّهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ فِي ظِلِّهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 39,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-40-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدُهُ مِنَ النَّارِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الشهادة",
      "bookNumber": 40,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-41-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ الصَّلاةَ وَالْقِنَابِلَ صَلَّى قَبْلَكُمْ وَبَعْدَكُمْ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 41,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-42-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ تَوَضَّأَ ثُمَّ قَالَ: أَشْهَدُ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، فُتِحَتْ لَهُ أَبْوَابُ الْجَنَّةِ الثَّمَانَةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 42,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-43-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: اجْعَلُوا مِنْ صَلاتِكُمْ فِي بُيُوتِكُمْ، وَلا تَتَّخِذُوهَا قُبُورًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 43,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-44-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا حَسَدَ إِلاَّ فِي اثْنَتَيْنِ.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 44,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-45-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَوْ يَعْلَمُ النَّاسُ مَا فِي الْهِلْعِ لَمْ يَسْتَلِمَّ أَحَدٌ إِلاَّ جَنْبًا وَاحِدًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 45,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-21-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَنْ يُؤْمِنَ أَحَدُكُمْ حَتَّى يُحِبَّ أَبَا بَكْرٍ وَعُمَرَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الفضائل",
      "bookNumber": 21,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-21-2",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَيُعَلِّمُهُ.",
      "narrator": "أبو موسى",
      "sourceBook": "Sahih Muslim",
      "chapter": "القراءات",
      "bookNumber": 21,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-22-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 22,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-22-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بُعِدَتْ لَهُ بَيْنَهُ وَبَيْنَ النَّارِ سَبْعِينَ خَرِيفًا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 22,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-23-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 23,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "bukhari-46-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَنْ يُؤْمِنَ أَحَدُكُمْ حَتَّى يُحِبَّ أَخَاهُ لِحُبِّهِ إِيَّايَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 46,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-47-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجَهَا إِلاَّ بِإِذْنِهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصيام",
      "bookNumber": 47,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-48-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَلَّى صَلاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ صَلاةٌ نَاقِصَةٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 48,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-49-1",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ لِكُلِّ نَبِيٍّ حَرِيمًا، وَإِنَّ حَرِيمِي الصَّلاةُ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 49,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-50-1",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ: الصِّحَّةُ وَالْفَرَاغُ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 50,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-24-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُحِلُّ لِلْمَرْأَةِ أَنْ تَصُومَ وَزَوْجَهَا إِلاَّ بِإِذْنِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 24,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-24-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَصُومُنَ الْمَرْأَةُ يَوْمَيْنِ إِلاَّ كَانَ قَبْلَهُا يَوْمٌ لَهَا فِي صِيَامِ زَوْجِهَا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 24,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-25-1",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: طُوبُ لِمَنْ شَغَلَتْهُ الصَّلاةُ عَنِ الدُّنْيَا.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 25,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-25-2",
      "arabicText": "عَنْ عُثْمَانَ بْنِ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ.",
      "narrator": "عثمان بن عفان",
      "sourceBook": "Sahih Muslim",
      "chapter": "الفضائل",
      "bookNumber": 25,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-26-1",
      "arabicText": "عَنْ أَبِي ذَرٍّ رَضِيَ اللَّهُ عَنْهُ: سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم: أَيُّ الأَعْمَالِ أَفْضَلُ؟ قَالَ: الإِيمَانُ بِاللَّهِ وَالْجِهَادُ فِي سَبِيلِهِ.",
      "narrator": "أبو ذر الغفاري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 26,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-27-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الدِّينُ النَّصِيحَةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 27,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-28-1",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِي الإِسْلامُ عَلَى خَمْسٍ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 28,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-29-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا صَلَّى أَحَدُكُمْ فَلْيَسْتَنْثِرْ، وَإِذَا أَتَى الْخَلاءَ فَلْيَسْتَنْجِزْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 29,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "bukhari-51-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَنْ يُؤْمِنَ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 51,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-52-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ مِنْ شِرَارِ الْقُرْآنِ لَيَسَ فِيهِ شَيْءٌ إِلاَّ بِهِ خَيْرٌ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 52,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-53-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 53,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-54-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَا مِنْ شَيْءٍ يُوضَعُ فِي الْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ الْخُلُقِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 54,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-55-1",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ وَهُوَ يَعِظُهُ: يَا غُلامُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 55,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-56-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 56,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-57-1",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِي الإِسْلامُ عَلَى خَمْسٍ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 57,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-58-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَلَّى صَلاةً لَمْ يَقْرَأْ فِيهَا بِأُمِّ الْقُرْآنِ فَهِيَ صَلاةٌ نَاقِصَةٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 58,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-30-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَنْ يُؤْمِنَ أَحَدُكُمْ حَتَّى يُحِبَّ أَبَا بَكْرٍ وَعُمَرَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الفضائل",
      "bookNumber": 30,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-30-2",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَيُعَلِّمُهُ.",
      "narrator": "أبو موسى",
      "sourceBook": "Sahih Muslim",
      "chapter": "القراءات",
      "bookNumber": 30,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-31-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 31,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-31-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بُعِدَتْ لَهُ بَيْنَهُ وَبَيْنَ النَّارِ سَبْعِينَ خَرِيفًا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 31,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "bukhari-59-1",
      "arabicText": "عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ.",
      "narrator": "عثمان بن عفان",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "فضائل القرآن",
      "bookNumber": 59,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-59-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ، وَالَّذِي يَقْرَأُ الْقُرْآنَ وَيَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "فضائل القرآن",
      "bookNumber": 59,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-59-3",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُؤْمِنُ الَّذِي يَقْرَأُ الْقُرْآنَ وَهُوَ مِثْلُ التَّمْرَةِ طَعْمُهَا طَيِّبٌ وَرِيحُهَا طَيِّبٌ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "فضائل القرآن",
      "bookNumber": 59,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-60-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ وَجَدَ سَعَةً فَلَمْ يُضَحِّ فَلا يَقْرَبَنَّ مُصَلَّانَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأضاحي",
      "bookNumber": 60,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-60-2",
      "arabicText": "عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا تَذْبَحُوا إِلا مُسِنَّةً إِلا أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ.",
      "narrator": "علي بن أبي طالب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأضاحي",
      "bookNumber": 60,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-61-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: قَالَ اللَّهُ: كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلا الصِّيَامَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصوم",
      "bookNumber": 61,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-61-2",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدَ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصوم",
      "bookNumber": 61,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-61-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصوم",
      "bookNumber": 61,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-61-4",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجْتَهِدُ فِي الْعَشْرِ الأَوَاخِرِ مَا لا يَجْتَهِدُ فِي غَيْرِهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصوم",
      "bookNumber": 61,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-62-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التطوع",
      "bookNumber": 62,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-62-2",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: بَلِّغُوا عَنِّي وَلَوْ آيَةً، وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلا حَرَجَ، وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التطوع",
      "bookNumber": 62,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-63-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: قَالَ اللَّهُ: أَعْدَدْتُ لِعِبَادِي الصَّالِحِينَ مَا لا عَيْنٌ رَأَتْ وَلا أُذُنٌ سَمِعَتْ وَلا خَطَرَ عَلَى قَلْبِ بَشَرٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجنة",
      "bookNumber": 63,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-63-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا يَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الأُفُقِ مِنَ الْمَشْرِقِ أَوِ الْمَغْرِبِ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجنة",
      "bookNumber": 63,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-63-3",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: فِي الْجَنَّةِ شَجَرَةٌ يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لا يَقْطَعُهَا.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجنة",
      "bookNumber": 63,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "muslim-32-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الدُّعَاءُ هُوَ الْعِبَادَةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الذكر والدعاء",
      "bookNumber": 32,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-32-2",
      "arabicText": "عَنْ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ الْحَلالَ بَيِّنٌ وَإِنَّ الْحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ.",
      "narrator": "النعمان بن بشير",
      "sourceBook": "Sahih Muslim",
      "chapter": "المسائل المشتبهة",
      "bookNumber": 32,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-32-3",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: مَثَلُ الْمُؤْمِنِ الَّذِي يَقْرَأُ الْقُرْآنَ مَثَلُ الأُتْرُجَّةِ رِيحُهَا طَيِّبٌ وَطَعْمُهَا طَيِّبٌ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "فضائل القرآن",
      "bookNumber": 32,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-33-1",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ، وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Muslim",
      "chapter": "رقائق الإيمان",
      "bookNumber": 33,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-33-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَكْثَرُ عَذَابِ الْقَبْرِ مِنَ الْبَوْلِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 33,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-33-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: لَوْلا أَنْ أَشُقَّ عَلى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلاةٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 33,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-33-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِذَا تَوَضَّأَ الْعَبْدُ الْمُسْلِمُ - أَوِ الْمُؤْمِنُ - فَغَسَلَ وَجْهَهُ خَرَجَتْ مِنْ وَجْهِهِ كُلُّ خَطِيئَةٍ نَظَرَ إِلَيْهَا بِعَيْنِهِ مَعَ الْمَاءِ - أَوْ مَعَ آخِرِ قَطْرِ الْمَاءِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 33,
      "hadithNumber": 4,
      "collection": "muslim"
    },
    {
      "id": "muslim-34-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: أَسْرِعُوا بِالْجَنَائِزِ فَإِنْ تَكُ صَالِحَةً فَخَيْرٌ تُقَدِّمُونَهَا إِلَيْهِ، وَإِنْ تَكُ سِوَى ذَلِكَ فَشَرٌّ تَضَعُونَهُ عَنْ رِقَابِكُمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنائز",
      "bookNumber": 34,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-34-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ تَبِعَ جَنَازَةً مِنْ أَهْلِ الإِيمَانِ وَالإِسْلامِ وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا وَيَفْرُغَ مِنْ دَفْنِهَا فَإِنَّهُ يَخْرُجُ مِنَ الأَجْرِ قِيرَاطَيْنِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنائز",
      "bookNumber": 34,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-35-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ تَصَدَّقَ بِعَدْلِ تَمْرَةٍ مِنْ كَسْبٍ طَيِّبٍ - وَلا يَقْبَلُ اللَّهُ إِلاَّ الطَّيِّبَ - فَإِنَّ اللَّهَ يَتَقَبَّلُهَا بِيَمِينِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزكاة",
      "bookNumber": 35,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-35-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: يَا نِسَاءَ الْمُسْلِمَاتِ لا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الهبات",
      "bookNumber": 35,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-35-3",
      "arabicText": "عَنْ عَدِيِّ بْنِ حَاتِمٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ.",
      "narrator": "عدي بن حاتم",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزكاة",
      "bookNumber": 35,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "bukhari-64-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ الأَعْمَالِ أَفْضَلُ؟ قَالَ: إِيمَانٌ بِاللَّهِ وَرَسُولِهِ. قِيلَ: ثُمَّ مَاذَا؟ قَالَ: جِهَادٌ فِي سَبِيلِ اللَّهِ. قِيلَ: ثُمَّ مَاذَا؟ قَالَ: حَجٌّ مَبْرُورٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الحج",
      "bookNumber": 64,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-64-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ: يَا رَسُولَ اللَّهِ، نَرَى الْجِهَادَ أَفْضَلَ الأَعْمَالِ، أَفَلا نُجَاهِدُ؟ قَالَ: لا، لَكِنَّ أَفْضَلُ الْجِهَادِ حَجٌّ مَبْرُورٌ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الحج",
      "bookNumber": 64,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-64-3",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: مَا مِنْ أَيَّامٍ الْعَمَلُ الصَّالِحُ فِيهَا أَحَبُّ إِلَى اللَّهِ مِنَ الْعَمَلِ الصَّالِحِ فِي هَذِهِ الأَيَّامِ - يَعْنِي أَيَّامَ الْعَشْرِ - قَالُوا: يَا رَسُولَ اللَّهِ، وَلا الْجِهَادُ فِي سَبِيلِ اللَّهِ؟ قَالَ: وَلا الْجِهَادُ فِي سَبِيلِ اللَّهِ، إِلا رَجُلٌ خَرَجَ بِنَفْسِهِ وَمَالِهِ فَلَمْ يَرْجِعْ مِنْ ذَلِكَ بِشَيْءٍ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الحج",
      "bookNumber": 64,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-64-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ: مَنْ حَجَّ لِلَّهِ فَلَمْ يَرْفُثْ وَلَمْ يَفْسُقْ رَجَعَ كَيَوْمِ وَلَدَتْهُ أُمُّهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الحج",
      "bookNumber": 64,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-65-1",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: رِبَاطُ يَوْمٍ وَلَيْلَةٍ خَيْرٌ مِنْ صِيَامِ شَهْرٍ وَقِيَامِهِ، وَإِنْ مَاتَ جَرَى عَلَيْهِ عَمَلُهُ الَّذِي كَانَ يَعْمَلُهُ، وَأُجْرِيَ عَلَيْهِ رِزْقُهُ، وَأُمِنَ الْفَتَّانُ.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 65,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-65-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ نَفْسَهُ بِالْغَزْوِ مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 65,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-65-3",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: جَاهِدُوا الْمُشْرِكِينَ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ وَأَلْسِنَتِكُمْ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 65,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-66-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ الْمُؤْمِنَ لَيُدْرِكَ بِحُسْنِ خُلُقِهِ دَرَجَةَ الصَّائِمِ الْقَائِمِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 66,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-66-2",
      "arabicText": "عَنْ ابْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا قَالَ: لَمْ يَكُنِ النَّبِيُّ صلى الله عليه وسلم فَاحِشًا وَلا مُتَفَحِّشًا، وَكَانَ يَقُولُ: إِنَّ مِنْ خَيْرِكُمْ أَحْسَنَكُمْ خُلُقًا.",
      "narrator": "عبدالله بن عمرو",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 66,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-66-3",
      "arabicText": "عَنْ أَبِي الدَّرْدَاءِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: مَا مِنْ شَيْءٍ أَثْقَلُ فِي مِيزَانِ الْمُؤْمِنِ يَوْمَ الْقِيَامَةِ مِنْ حُسْنِ الْخُلُقِ، وَإِنَّ اللَّهَ لَيُبْغِضُ الْفَاحِشَ الْبَذِيءَ.",
      "narrator": "أبو الدرداء",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 66,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-66-4",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ، وَيُعْطِي عَلَى الرِّفْقِ مَا لا يُعْطِي عَلَى الْعُنْفِ وَمَا لا يُعْطِي عَلَى مَا سِوَاهُ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 66,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-66-5",
      "arabicText": "عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ: مَنْ لا يَرْحَمْ لا يُرْحَمْ.",
      "narrator": "جرير بن عبدالله",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 66,
      "hadithNumber": 5,
      "collection": "bukhari"
    },
    {
      "id": "muslim-36-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: وَاللَّهِ إِنِّي لَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الاستغفار",
      "bookNumber": 36,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-36-2",
      "arabicText": "عَنْ الأَغَرِّ الْمُزَنِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: يَا أَيُّهَا النَّاسُ، تُوبُوا إِلَى اللَّهِ وَاسْتَغْفِرُوهُ، فَإِنِّي أَتُوبُ فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ.",
      "narrator": "الأغر المزني",
      "sourceBook": "Sahih Muslim",
      "chapter": "الاستغفار",
      "bookNumber": 36,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-36-3",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ، فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ، وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 36,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-37-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ: لِمَالِهَا وَحَسَبِهَا وَجَمَالِهَا وَدِينِهَا، فَظَفِرْتَ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 37,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-37-2",
      "arabicText": "عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ رَزَقَهُ اللَّهُ امْرَأَةً صَالِحَةً فَقَدْ أَعَانَهُ عَلَى شَطْرِ دِينِهِ، فَلْيَتَّقِ اللَّهَ فِي الشَّطْرِ الآخَرِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 37,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-37-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: إِذَا صَلَّى أَحَدُكُمْ فَلا يَدَعْنَ يَقْعُدُ عَلَى قِبَالَتِهِ، فَإِنَّ اللَّهَ يُحِبُّ الأَدَبَ وَالتَّأَدُّبَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الأدب",
      "bookNumber": 37,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-38-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ اللَّهَ قَدَّرَ مَقَادِيرَ الْخَلائِقِ قَبْلَ أَنْ يَخْلُقَ السَّمَاوَاتِ وَالأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ.",
      "narrator": "عبدالله بن عمرو",
      "sourceBook": "Sahih Muslim",
      "chapter": "القدر",
      "bookNumber": 38,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-38-2",
      "arabicText": "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ عَبْدٌ حَتَّى يُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ.",
      "narrator": "جابر بن عبدالله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 38,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-38-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: وَالَّذِي نَفْسِي بِيَدِهِ، لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 38,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-39-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ سُئِلَ عَنْ عِلْمٍ عَلِمَهُ ثُمَّ كَتَمَهُ أَلْجَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "العلم",
      "bookNumber": 39,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-39-2",
      "arabicText": "عَنْ مُعَاوِيَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ.",
      "narrator": "معاوية بن أبي سفيان",
      "sourceBook": "Sahih Muslim",
      "chapter": "العلم",
      "bookNumber": 39,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-39-3",
      "arabicText": "عَنْ أَبِي أُمَامَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِي عَلَى أَدْنَاكُمْ.",
      "narrator": "أبي أمامة",
      "sourceBook": "Sahih Muslim",
      "chapter": "فضائل العلماء",
      "bookNumber": 39,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-39-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلا مِنْ ثَلاثَةٍ: صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الوصايا",
      "bookNumber": 39,
      "hadithNumber": 4,
      "collection": "muslim"
    },
    {
      "id": "bukhari-67-1",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّ نَاسًا مِنَ الأَنْصَارِ سَأَلُوا رَسُولَ اللَّهِ صلى الله عليه وسلم فَأَعْطَاهُمْ، ثُمَّ سَأَلُوهُ فَأَعْطَاهُمْ، حَتَّى نَفِدَ مَا عِنْدَهُ، فَقَالَ: مَا يَكُونُ عِنْدِي مِنْ خَيْرٍ فَلَنْ أَدَّخِرَهُ عَنْكُمْ، وَمَنْ يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ، وَمَنْ يَسْتَغْنِ يُغْنِهِ اللَّهُ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الزهد",
      "bookNumber": 67,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-67-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَوْ أَنَّكُمْ تَوَكَّلْتُمْ عَلَى اللَّهِ حَقَّ تَوَكُّلِهِ لَرَزَقَكُمْ كَمَا يَرْزُقُ الطَّيْرَ تَغْدُو خِمَاصًا وَتَرُوحُ بِطَانًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التوكل",
      "bookNumber": 67,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-67-3",
      "arabicText": "عَنْ صُهَيْبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: عَجَبًا لأَمْرِ الْمُؤْمِنِ، إِنَّ أَمْرَهُ كُلَّهُ لَهُ خَيْرٌ، وَلَيْسَ ذَلِكَ لأَحَدٍ إِلا لِلْمُؤْمِنِ، إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ، وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ.",
      "narrator": "صهيب الرومي",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الزهد",
      "bookNumber": 67,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-68-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَبْغَضُ الْحَلالِ إِلَى اللَّهِ الطَّلاقُ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطلاق",
      "bookNumber": 68,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-68-2",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ الْمَرْأَةَ تُنْكَحُ لِدِينِهَا وَمَالِهَا وَجَمَالِهَا، فَعَلَيْكَ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "النكاح",
      "bookNumber": 68,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-69-1",
      "arabicText": "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا، فَمَا بَقِيَ فَهُوَ لأَوْلَى رَجُلٍ ذَكَرٍ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفرائض",
      "bookNumber": 69,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-69-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ أَنْ يُبْسَطَ لَهُ فِي رِزْقِهِ وَيُنْسَأَ لَهُ فِي أَثَرِهِ فَلْيَصِلْ رَحِمَهُ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأرحام",
      "bookNumber": 69,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-70-1",
      "arabicText": "عَنْ أَبِي بَكْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: أَلا أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ؟ ثَلاثًا: الإِشْرَاكُ بِاللَّهِ، وَعُقُوقُ الْوَالِدَيْنِ، وَشَهَادَةُ الزُّورِ - أَوْ قَوْلُ الزُّورِ - قَالَ: أَلَا وَقَوْلُ الزُّورِ، وَكَانَ مُتَّكِئًا فَجَلَسَ فَقَالَ: أَلا وَقَوْلُ الزُّورِ، أَلا أَقُولُ لَكُمْ.",
      "narrator": "أبو بكرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الشهادات",
      "bookNumber": 70,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-70-2",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: مِنَ الْكَبَائِرِ شَتْمُ الرَّجُلِ وَالِدَيْهِ. قَالُوا: يَا رَسُولَ اللَّهِ، وَهَلْ يَشْتِمُ الرَّجُلُ وَالِدَيْهِ؟ قَالَ: نَعَمْ، يَسُبُّ أَبَا الرَّجُلِ فَيَسُبُّ أَبَاهُ، وَيَسُبُّ أُمَّهُ فَيَسُبُّ أُمَّهُ.",
      "narrator": "عبدالله بن عمرو",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 70,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-71-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ خَرَجَ مِنَ الطَّاعَةِ وَفَارَقَ الْجَمَاعَةَ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً، وَمَنْ قُتِلَ تَحْتَ رَايَةٍ عِمِّيَّةٍ يَغْضَبُ لِلْعَصَبَةِ وَيُقَاتِلُ لِلْعَصَبَةِ فَمَاتَ مَاتَ مِيتَةً جَاهِلِيَّةً.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفتن",
      "bookNumber": 71,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-71-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ أَخُو الْمُسْلِمِ لا يَظْلِمُهُ وَلا يَخْذُلُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المظالم",
      "bookNumber": 71,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-71-3",
      "arabicText": "عَنْ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: تَرَى الْمُؤْمِنِينَ فِي تَرَاحُمِهِمْ وَتَوَادِّهِمْ وَتَعَاطُفِهِمْ كَمَثَلِ الْجَسَدِ إِذَا اشْتَكَى عُضْوٌ تَدَاعَى لَهُ سَائِرُ جَسَدِهِ بِالسَّهَرِ وَالْحُمَّى.",
      "narrator": "النعمان بن بشير",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأخوة",
      "bookNumber": 71,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "muslim-40-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: وَالَّذِي نَفْسِي بِيَدِهِ، لا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا، وَلا تُؤْمِنُوا حَتَّى تَحَابُّوا، أَوَلا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ؟ أَفْشُوا السَّلامَ بَيْنَكُمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "السلام",
      "bookNumber": 40,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-40-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ: إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ، وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَسَمِّتْهُ، وَإِذَا اسْتَنْصَحَكَ فَانْصَحْهُ، وَإِذَا سَعَلَ فَحَمِدَ اللَّهَ فَسَمِّتْهُ، وَإِذَا مَرِضَ فَعُدْهُ، وَإِذَا مَاتَ فَاتْبَعْهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "السلام",
      "bookNumber": 40,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-40-3",
      "arabicText": "عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ: أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ: يَا بُنَيَّ، إِذَا دَخَلْتَ عَلَى أَهْلِكَ فَسَلِّمْ، يَكُنْ بَرَكَةً عَلَيْكَ وَعَلَى أَهْلِ بَيْتِكَ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الآداب",
      "bookNumber": 40,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-41-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ عَادَ مَرِيضًا أَوْ زَارَ أَخًا لَهُ فِي اللَّهِ، نَادَاهُ مُنَادٍ: طِبْتَ وَطَابَ مَمْشَاكَ، وَتَبَوَّأْتَ مِنَ الْجَنَّةِ مَنْزِلاً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "العيادة",
      "bookNumber": 41,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-41-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِذَا دَخَلَ أَحَدُكُمْ عَلَى الْمَرِيضِ فَلْيَقُلْ: لا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "العيادة",
      "bookNumber": 41,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-42-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ مِنْ خَيْرِ أَيَّامِكُمْ يَوْمَ الْجُمُعَةِ، فِيهِ خُلِقَ آدَمُ، وَفِيهِ نُفِخَتِ الرُّوحُ، وَفِيهِ أُسْرِيَ بِي، وَفِيهِ أُنْزِلَتِ السَّاعَةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجمعة",
      "bookNumber": 42,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-42-2",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ لِي النَّبِيُّ صلى الله عليه وسلم: هَلْ تَدْرِي يَا سَلْمَانُ مَا يَوْمُ الْجُمُعَةِ؟ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: هُوَ الْيَوْمُ الَّذِي جَمَعَ اللَّهُ فِيهِ أَبَوَيْكَ.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجمعة",
      "bookNumber": 42,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-42-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ، ثُمَّ أَتَى الْجُمُعَةَ فَاسْتَمَعَ وَأَنْصَتَ، غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ الأُخْرَى وَزِيَادَةُ ثَلاثَةِ أَيَّامٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجمعة",
      "bookNumber": 42,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-43-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا أَقْبَلَ اللَّيْلُ مِنْ هَا هُنَا - وَأَدْبَرَ النَّهَارُ مِنْ هَا هُنَا - وَغَرَبَتِ الشَّمْسُ، فَقَدْ أَفْطَرَ الصَّائِمُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 43,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-43-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُقَبِّلُ وَهُوَ صَائِمٌ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 43,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-43-3",
      "arabicText": "عَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: فِي الْجَنَّةِ ثَمَانِيَةُ أَبْوَابٍ، فِيهَا بَابٌ يُقَالُ لَهُ الرَّيَّانُ، لا يَدْخُلُهُ إِلا الصَّائِمُونَ.",
      "narrator": "سهل بن سعد",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 43,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-44-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: رَفَعَ النَّبِيُّ صلى الله عليه وسلم صَوْتَهُ بِالتَّلْبِيَةِ وَقَالَ: لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لا شَرِيكَ لَكَ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Muslim",
      "chapter": "الحج",
      "bookNumber": 44,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-44-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ الأَعْمَالِ أَفْضَلُ؟ قَالَ: إِيمَانٌ بِاللَّهِ وَرَسُولِهِ. قِيلَ: ثُمَّ مَاذَا؟ قَالَ: جِهَادٌ فِي سَبِيلِ اللَّهِ. قِيلَ: ثُمَّ مَاذَا؟ قَالَ: حَجٌّ مَبْرُورٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الحج",
      "bookNumber": 44,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-44-3",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قُلْتُ: يَا رَسُولَ اللَّهِ، نَرَى الْجِهَادَ أَفْضَلَ الأَعْمَالِ، أَفَلا نُجَاهِدُ؟ قَالَ: لا، لَكِنَّ أَفْضَلُ الْجِهَادِ حَجٌّ مَبْرُورٌ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الحج",
      "bookNumber": 44,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "bukhari-72-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بَادِرُوا بِالأَعْمَالِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ، يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا، وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا، يَبِيعُ دِينَهُ بِعَرَضٍ مِنَ الدُّنْيَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفتن",
      "bookNumber": 72,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-72-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: سَارِعُوا إِلَى الْجَنَّةِ، وَالْجَنَّةُ وَرْدُكُمُ التَّقْوَى، وَسَارِعُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ، وَجَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالأَرْضُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 72,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-72-3",
      "arabicText": "عَنْ عُبَادَةَ بْنِ الصَّامِتِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ شَهِدَ أَنْ لا إِلَهَ إِلا اللَّهُ وَحْدَهُ لا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَأَنَّ عِيسَى عَبْدُ اللَّهِ وَرَسُولُهُ، وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، أَدْخَلَهُ اللَّهُ الْجَنَّةَ عَلَى مَا كَانَ مِنْ عَمَلٍ.",
      "narrator": "عبادة بن الصامت",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 72,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-73-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الشِّفَاءُ فِي ثَلاثَةٍ: شَرْبَةِ عَسَلٍ، وَشَرْطَةِ مِحْجَمٍ، وَكَيَّةٍ بِنَارٍ، وَأَنْهَى أُمَّتِي عَنِ الْكَيِّ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطب",
      "bookNumber": 73,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-73-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ اللَّهَ لَمْ يَضَعْ دَاءً إِلا وَضَعَ لَهُ شِفَاءً.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطب",
      "bookNumber": 73,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-73-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ، فَأَبْرِدُوهَا بِالْمَاءِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطب",
      "bookNumber": 73,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-74-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَشْرَبُ قَائِمًا وَقَاعِدًا.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأشربة",
      "bookNumber": 74,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-74-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا شَرِبَ أَحَدُكُمْ فَلْيَشْرَبْ بِيَمِينِهِ، وَإِذَا شَرِبَ فَلا يَتَنَفَّسْ فِي الإِنَاءِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأشربة",
      "bookNumber": 74,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-74-3",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: النَّظْرَةُ سَهْمٌ مِنْ سِهَامِ إِبْلِيسَ، مَنْ تَرَكَهَا مِنْ مَخَافَتِي أَبْدَلْتُهُ إِيمَانًا يَجِدُ حَلاوَتَهُ فِي قَلْبِهِ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "النكاح",
      "bookNumber": 74,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-75-1",
      "arabicText": "عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ النَّبِيُّ صلى الله عليه وسلم يُكْثِرُ أَنْ يَقُولَ: اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحُزْنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ قَهْرِ الرِّجَالِ وَدَيْنِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الدعوات",
      "bookNumber": 75,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-75-2",
      "arabicText": "عَنْ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم: عَلِّمْنِي دُعَاءً أَدْعُو بِهِ فِي صَلاتِي. قَالَ: قُلِ: اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلا يَغْفِرُ الذُّنُوبَ إِلا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.",
      "narrator": "أبو بكر الصديق",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الدعوات",
      "bookNumber": 75,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-75-3",
      "arabicText": "عَنِ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ النَّبِيُّ صلى الله عليه وسلم يَقُولُ: اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الدعوات",
      "bookNumber": 75,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "muslim-45-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: صَلاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَنْ صَلاتِهِ فِي سُوقِهِ وَبَيْتِهِ بِضْعًا وَعِشْرِينَ دَرَجَةً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "المسجد",
      "bookNumber": 45,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-45-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: أَلا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ؟ قَالُوا: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ، وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ، وَانْتِظَارُ الصَّلاةِ بَعْدَ الصَّلاةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 45,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-45-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمَلائِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مَصَلاهُ الَّذِي صَلَّى فِيهِ، مَا لَمْ يُحْدِثْ، تَقُولُ: اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ارْحَمْهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 45,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-46-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: دُلَّنِي عَلَى عَمَلٍ يَعْدِلُ الْجِهَادَ. قَالَ: لا أَجِدُهُ. قَالَ: هَلْ تَسْتَطِيعُ إِذَا خَرَجَ الْمُجَاهِدُ أَنْ تَدْخُلَ مَسْجِدَكَ فَتَقُومَ فَلا تَفْتُرَ، وَتَصُومَ فَلا تُفْطِرَ؟ قَالَ: وَمَنْ يَسْتَطِيعُ ذَلِكَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجهاد",
      "bookNumber": 46,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-46-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالإِسْلامِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا، وَجَبَتْ لَهُ الْجَنَّةُ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 46,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-46-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَلا أُخْبِرُكُمْ بِمَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ؟ إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ، وَمَشْيُكُمْ إِلَى الْمَسَاجِدِ، وَانْتِظَارُ الصَّلاةِ بَعْدَ الصَّلاةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 46,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-47-1",
      "arabicText": "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: رَحِمَ اللَّهُ رَجلاً سَمْحًا إِذَا بَاعَ، وَإِذَا اشْتَرَى، وَإِذَا اقْتَضَى.",
      "narrator": "جابر بن عبدالله",
      "sourceBook": "Sahih Muslim",
      "chapter": "البيوع",
      "bookNumber": 47,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-47-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ غَشَّنَا فَلَيْسَ مِنَّا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 47,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-47-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: مَنْ اشْتَرَى طَعَامًا فَلا يَبِعْهُ حَتَّى يَسْتَوْفِيَهُ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Muslim",
      "chapter": "البيوع",
      "bookNumber": 47,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-48-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: تَهَادَوْا تَحَابُّوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الهبات",
      "bookNumber": 48,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-48-2",
      "arabicText": "عَنِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: تَصَدَّقُوا عَلَى ابْنِي، فَقَالَتْ امْرَأَتُهُ: أَتَصَدَّقُ عَلَى ابْنِي وَلَيْسَ لِي وَلَهُ إِلا مَا لَكَ؟ فَقَالَ: الرَّجُلُ رَاعٍ فِي أَهْلِهِ، وَمَسْؤُولٌ عَنْ رَعِيَّتِهِ.",
      "narrator": "النعمان بن بشير",
      "sourceBook": "Sahih Muslim",
      "chapter": "الهبات",
      "bookNumber": 48,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-48-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: يَا نِسَاءَ الْمُسْلِمَاتِ، لا تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الهبات",
      "bookNumber": 48,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-49-1",
      "arabicText": "عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِي: يَا غُلامُ، سَمِّ اللَّهَ، وَكُلْ بِيَمِينِكَ، وَكُلْ مِمَّا يَلِيكَ.",
      "narrator": "عمر بن أبي سلمة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الأشربة",
      "bookNumber": 49,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-49-2",
      "arabicText": "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِلَسْانِهِ يَوْمَ خَيْبَرَ فَقَالَ: لا يَدْخُلَنَّ الْجَنَّةَ أَحَدٌ لا يَأْمَنُ جَارُهُ بَوَائِقَهُ.",
      "narrator": "جابر بن عبدالله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 49,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-49-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: طَعَامُ الْاِثْنَيْنِ يَكْفِي الثَّلاثَةَ، وَطَعَامُ الثَّلاثَةِ يَكْفِي الأَرْبَعَةَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الأطعمة",
      "bookNumber": 49,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "bukhari-76-1",
      "arabicText": "عَنْ مَعْقِلِ بْنِ يَسَارٍ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: مَا مِنَ عَبْدٍ يَسْتَرْعِيهِ اللَّهُ رَعِيَّةً يَمُوتُ يَوْمَ يَمُوتُ وَهُوَ غَاشٌّ لِرَعِيَّتِهِ إِلا حَرَّمَ اللَّهُ عَلَيْهِ الْجَنَّةَ.",
      "narrator": "معقل بن يسار",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإمارة",
      "bookNumber": 76,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-76-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإمارة",
      "bookNumber": 76,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-76-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: عَلَيْكُمْ بِالسَّمْعِ وَالطَّاعَةِ فِي عُسْرِكُمْ وَيُسْرِكُمْ وَمَنْشَطِكُمْ وَمَكْرَهِكُمْ وَأَثَرَةٍ عَلَيْكُمْ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأحكام",
      "bookNumber": 76,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-77-1",
      "arabicText": "عَنْ أُمِّ سَلَمَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: إِنَّكُمْ تَخْتَصِمُونَ إِلَيَّ، وَلَعَلَّ بَعْضَكُمْ أَنْ يَكُونَ أَلْحَنَ بِحُجَّتِهِ مِنْ بَعْضٍ، فَمَنْ قَضَيْتُ لَهُ بِحَقِّ مُسْلِمٍ فَإِنَّمَا هِيَ قِطْعَةٌ مِنَ النَّارِ فَلْيَأْخُذْهَا أَوْ يَدَعْهَا.",
      "narrator": "أم سلمة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "القضايا",
      "bookNumber": 77,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-77-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: مَنْ أَخَذَ مِنَ الأَرْضِ شَيْئًا بِغَيْرِ حَقِّهِ خُبِطَ بِهِ يَوْمَ الْقِيَامَةِ بِسَبْعِ أَرْضِينَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المظالم",
      "bookNumber": 77,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-78-1",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَتَمَنَّيَنَّ أَحَدُكُمُ الْمَوْتَ لِضُرٍّ نَزَلَ بِهِ، إِنْ كَانَ لا بُدَّ مُتَمَنِّيًا فَلْيَقُلْ: اللَّهُمَّ أَحْيِنِي مَا كَانَتِ الْحَيَاةُ خَيْرًا لِي، وَتَوَفَّنِي إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِي.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التمني",
      "bookNumber": 78,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-78-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِقْبَالُكُمْ إِلَى بَعْضِكُمْ فِي الصَّلاةِ كَإِقْبَالِ الْمَلائِكَةِ عَلَى بَعْضِهِمْ فِي التَّكْبِيرِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 78,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-78-3",
      "arabicText": "عَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا تَغْضَبُوا، وَلا تَسْأَلُوا الْمَلِكَ، وَلا تَمْنَعُوا فَضْلَ الْمَاءِ، وَلا تَمْنَعُوا فَضْلَ اللَّبَنِ.",
      "narrator": "جابر بن عبدالله",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المظالم",
      "bookNumber": 78,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-79-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: إِنَّ مِنَ الشَّجَرِ شَجَرَةً لا يَسْقُطُ وَرَقُهَا، وَهِيَ مَثَلُ الْمُسْلِمِ، فَحَدِّثُونِي مَا هِيَ؟ فَوَقَعَ فِي نَفْسِي أَنَّهَا النَّخْلَةُ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "البدء",
      "bookNumber": 79,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-79-2",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: مَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ الْغَيْثِ الْكَثِيرِ أَصَابَ أَرْضًا.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 79,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-79-3",
      "arabicText": "عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: لا تَكْذِبُوا عَلَيَّ فَإِنَّهُ مَنْ كَذَبَ عَلَيَّ فَلْيَلِجَ النَّارَ.",
      "narrator": "علي بن أبي طالب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 79,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "muslim-50-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَصْدَقُ كَلِمَةٍ قَالَهَا شَاعِرٌ كَلِمَةُ لَبِيدٍ: أَلا كُلُّ شَيْءٍ مَا خَلا اللَّهَ بَاطِلُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الشعر",
      "bookNumber": 50,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-50-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا أَنَّهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ مِنَ الشِّعْرِ حِكْمَةً.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الشعر",
      "bookNumber": 50,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-51-1",
      "arabicText": "عَنْ أَبِي قَتَادَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الرُّؤْيَا الصَّالِحَةُ - وَمِنَ اللَّهِ - فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلا يُحَدِّثْ بِهِ إِلا مَنْ يُحِبُّ.",
      "narrator": "أبو قتادة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الرؤيا",
      "bookNumber": 51,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-51-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ: إِذَا رَأَى أَحَدُكُمْ رُؤْيَا يُحِبُّهَا فَإِنَّمَا هِيَ مِنَ اللَّهِ فَلْيَحْمَدِ اللَّهَ عَلَيْهَا وَلْيُحَدِّثْ بِهَا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الرؤيا",
      "bookNumber": 51,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-51-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الرُّؤْيَا ثَلاثَةٌ: بَشَرَى مِنَ اللَّهِ، وَحُلْمٌ مِنَ الشَّيْطَانِ، وَمَا يُحَدِّثُ بِهِ الْمَرْءُ نَفْسَهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الرؤيا",
      "bookNumber": 51,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-52-1",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ الْمُؤْمِنَ لِلْمُؤْمِنِ كَالْبُنْيَانِ يَشُدُّ بَعْضُهُ بَعْضًا.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 52,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-52-2",
      "arabicText": "عَنْ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: مَثَلُ الْمُؤْمِنِينَ فِي تَوَادِّهِمْ وَتَرَاحُمِهِمْ وَتَعَاطُفِهِمْ مَثَلُ الْجَسَدِ، إِذَا اشْتَكَى مِنْهُ عُضْوٌ تَدَاعَى لَهُ سَائِرُ الْجَسَدِ بِالسَّهَرِ وَالْحُمَّى.",
      "narrator": "النعمان بن بشير",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 52,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-52-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ أَخُو الْمُسْلِمِ لا يَظْلِمُهُ وَلا يَخْذُلُهُ، وَمَنْ كَانَ فِي حَاجَةِ أَخِيهِ كَانَ اللَّهُ فِي حَاجَتِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 52,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-53-1",
      "arabicText": "عَنْ أَبِي مُوسَى رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: عَلَى كُلِّ مُسْلِمٍ صَدَقَةٌ. قَالُوا: يَا رَسُولَ اللَّهِ، فَإِنْ لَمْ يَجِدْ؟ قَالَ: يَعْمَلُ بِيَدِهِ فَيَنْفَعُ نَفْسَهُ وَيَتَصَدَّقُ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزكاة",
      "bookNumber": 53,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-53-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ اللَّهَ يُحِبُّ إِذَا عَمِلَ أَحَدُكُمْ عَمَلاً أَنْ يُتْقِنَهُ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإحسان",
      "bookNumber": 53,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-53-3",
      "arabicText": "عَنْ شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ اللَّهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذَّبْحَ.",
      "narrator": "شداد بن أوس",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيد",
      "bookNumber": 53,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-54-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا تَحَاسَدُوا، وَلا تَنَاجَشُوا، وَلا تَبَاغَضُوا، وَلا تَدَابَرُوا، وَلا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إِخْوَانًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 54,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-54-2",
      "arabicText": "عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 54,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-54-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: حِجَابُ الْمَرْأَةِ وَجْهُهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 54,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-55-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ اللَّهَ تَعَالَى يَقُولُ: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ حِينَ يَذْكُرُنِي.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الذكر",
      "bookNumber": 55,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-55-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسِيرُ فِي طَرِيقِ مَكَّةَ فَمَرَّ عَلَى جَبَلٍ يُقَالُ لَهُ: جُمُدَانُ، فَقَالَ: سِيرُوا هَذَا قَدْ فَرَّغَ مِنْهُ الْقَلْبُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الرقائق",
      "bookNumber": 55,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-55-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ.",
      "narrator": "عبدالله بن عمرو",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 55,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "bukhari-80-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا فَخَارَ وَلا فَخَرَ إِلا فِي الْحِكْمَةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 80,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-80-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: الْكَلِمَةُ الْحِكْمَةُ ضَالَّةُ الْمُؤْمِنِ، فَحَيْثُمَا وَجَدَهَا فَهُوَ أَحَقُّ بِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "العلم",
      "bookNumber": 80,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-80-3",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: نِعْمَتِ الصُّحْبَةُ عَبْدُ اللَّهِ، نِعْمَتِ الصُّحْبَةُ عَبْدُ اللَّهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المناقب",
      "bookNumber": 80,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-80-4",
      "arabicText": "عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ النَّبِيُّ صلى الله عليه وسلم: أَنا مَدِينَةُ الْعِلْمِ وَعَلِيٌّ بَابُهَا، فَمَنْ أَرَادَ الْعِلْمَ فَلْيَأْتِ الْبَابَ.",
      "narrator": "علي بن أبي طالب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 80,
      "hadithNumber": 4,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-80-5",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الدُّنْيَا سِجْنُ الْمُؤْمِنِ وَجَنَّةُ الْكَافِرِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الزهد",
      "bookNumber": 80,
      "hadithNumber": 5,
      "collection": "bukhari"
    },
    {
      "id": "muslim-56-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَوْتُ الْفَجْأَةِ تَحْيِينَ الْمُؤْمِنِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزهد",
      "bookNumber": 56,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-56-2",
      "arabicText": "عَنْ أَنَسٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ثَلاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلاوَةَ الإِيمَانِ: مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 56,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-56-3",
      "arabicText": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ: الصِّحَّةُ وَالْفَرَاغُ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزهد",
      "bookNumber": 56,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-56-4",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَوْلا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 56,
      "hadithNumber": 4,
      "collection": "muslim"
    },
    {
      "id": "muslim-57-1",
      "arabicText": "عَنْ عِيَاضِ بْنِ حِمَارٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّ اللَّهَ أَوْحَى إِلَيَّ أَنْ تَوَاضَعُوا، حَتَّى لا يَفْخَرَ أَحَدٌ عَلَى أَحَدٍ.",
      "narrator": "عياد بن حمار",
      "sourceBook": "Sahih Muslim",
      "chapter": "الأدب",
      "bookNumber": 57,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-57-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْكِبْرُ بَطَرُ الْحَقِّ وَغَمْطُ النَّاسِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 57,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-57-3",
      "arabicText": "عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَدْخُلُ أَحَدٌ الْجَنَّةَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 57,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-58-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: عَلَيْكُمْ بِالصِّدْقِ فَإِنَّ الصِّدْقَ يَهْدِي إِلَى الْبِرِّ، وَإِنَّ الْبِرَّ يَهْدِي إِلَى الْجَنَّةِ.",
      "narrator": "عبدالله بن مسعود",
      "sourceBook": "Sahih Muslim",
      "chapter": "البر",
      "bookNumber": 58,
      "hadithNumber": 1,
      "collection": "muslim"
    }
  ]
}