{
  "metadata": {
    "version": "1.0",
    "count": 10,
    "lastUpdated": "2026-02-18",
    "source": "Curated from authentic collections"
  },
  "collections": [
    {
      "name": "bukhari",
      "displayName": "Sahih Al-Bukhari",
      "arabicName": "صحيح البخاري",
      "count": 5
    },
    {
      "name": "muslim",
      "displayName": "Sahih Muslim",
      "arabicName": "صحيح مسلم",
      "count": 5
    }
  ],
  "hadiths": [
    {
      "id": "bukhari-1-1",
      "arabicText": "عَنْ عُمَرَ بْنَ الْخَطَّابِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا يَلْقَى الرَّجُلُ يُلْقِي شَرْفًا مِنْ شَرَفٍ وَنَعْتَمَا مِنْ إِبْلِهِ الْيَوْمَ، أَنْ يَلْقَى شَرْفًا غَدًا أَحْمَدَ لَهُ أَنْ لَمْ يَرْجِعْ.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "كيف كان بدء الوحي",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-2",
      "arabicText": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلِمَةَ، قَالَ: حَدَّثَنَا مَالِكٌ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ سُلَيْمَانَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: إِذَا نُودِيَ الصَّلاةُ أَدْبِرُوا الصَّلاةَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأذان",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-3",
      "arabicText": "حَدَّثَنَا عَلِيٌّ، قَالَ: حَدَّثَنَا سُفْيَانُ، قَالَ: حَدَّثَنِي ابْنُ نُمَيْرٍ، قَالَ: حَدَّثَنِي عَامِرٌ، عَنْ أَبِي بَكْرِ بْنِ نَافِعٍ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: مَنْ آتَاهُ وَهُوَ يَظُنُّ أَنْ لَنْ يَقُومَ قَامَ مِنْ مَالٍ يُرِيدُ أَنْ يُتَصَدَّقَ بِهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِي الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الإِيمَانُ بِضْعٍ وَسَبْعِينَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ وَاحِدَةٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "muslim-1-1",
      "arabicText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ نَافِعٍ، وَذَكَرُ عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: إِذَا نُودِيَتِ الصَّلاةُ فَأْتُوهَا وَأَنْتُمْ تَمْشُونَ، وَأْتُوهَا وَأَنْتُمْ تَرْكَبُونَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد ومواضع الصلاة",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-1-2",
      "arabicText": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا مَالِكٌ، عَنْ سُلَيْمَانَ الأَكْحَلِ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ: قُلْتُ يَا رَسُولَ اللَّهِ، أَيُّصَلَّى الرَّجُلُ وَهُوَ جُنُبٌ؟ قَالَ: نَعَمْ، إِذَا وَجَدَ مَاءً.",
      "narrator": "أبو مسعود الأنصاري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-1",
      "arabicText": "حَدَّثَنَا عُمَرُ بْنُ سَعْدٍ الأَمَوِيُّ، حَدَّثَنَا ابْنُ عُيَيْنَةَ، عَنْ مَالِكٍ، عَنْ أَبِي الزِّنَادِ، عَنْ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: الطُّهُورُ شَطْرٌ، فَمَنْ شَرَعَ شَرْعَةً وَلَمْ يَنْسُخْهَا فَهُوَ كَمَنْ شَرَعَهَا، وَلَكِنْ مَنْ نَسَخَهَا فَيَنْبَغِي أَنْ لا يَكُونَ بِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الحج",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَالْيَدِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-3",
      "arabicText": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ: حَدَّثَنَا ابْنُ أَبِي مُرَةَ، قَالَ: حَدَّثَنَا هِشَامُ بْنُ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ثَلاثٌ مَنْ كُنَّ فِيهِنَّ لَمْ يَنْتَقِشْ نَارَ الْفُقَاقِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 3,
      "collection": "muslim"
    }
  ]
}
