{
  "metadata": {
    "version": "2.1",
    "count": 53,
    "lastUpdated": "2026-02-19",
    "source": "Curated from authentic collections"
  },
  "collections": [
    {
      "name": "bukhari",
      "displayName": "Sahih Al-Bukhari",
      "arabicName": "صحيح البخاري",
      "count": 31
    },
    {
      "name": "muslim",
      "displayName": "Sahih Muslim",
      "arabicName": "صحيح مسلم",
      "count": 22
    }
  ],
  "hadiths": [
    {
      "id": "bukhari-1-1",
      "arabicText": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "بدء الوحي",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-2",
      "arabicText": "عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحْدَثَ عَنْ حَدِيثٍ يُرَى أَنَّهُ كَذِبٌ وَهُوَ لا يَعْلَمُ أَنَّهُ كَذِبٌ فَهُوَ مِنْ الْكَاذِبِينَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-1-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلا يُؤْذِ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 1,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-1",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِي الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، وَإِقَامِ الصَّلاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الإِيمَانُ بِضْعٌ وَسَبْعُونَ شُعْبَةً، وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-2-3",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لا إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجهاد",
      "bookNumber": 2,
      "hadithNumber": 3,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-1",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ: أَيُّ الأَصْحَابُ أَعْظَمُ النَّاسِ إِيمَانًا؟ قَالَ: أَبُو بَكْرٍ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 3,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-3-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: لَوْلا أَنْ أَشُقَّ عَلَى أُمَّتِي - أَوْ عَلَى نَفْسِي - لَسَمِعْتُكُمْ تَكِيدُونَ فِي بَعْضِ أَمْرِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "التمنية",
      "bookNumber": 3,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-4-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ أَخَاهُ لِحُبِّهِ إِيَّايَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-4-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ثَلاَثٌ مَنْ كُنَّ فِيهِ وَجَدَ بِهِنَّ حَلاَوَةَ الإِيمَانِ: مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا، وَأَنْ يُحِبَّ الْمَرْءُ لاَ يُحِبُّهُ إِلاَّ لِلَّهِ، وَأَنْ يَكْرَهَ أَنْ يَعُودَ فِي الْكُفْرِ كَمَا يَكْرَهُ أَنْ يُقْذَفَ فِي النَّارِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-5-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِي ظِلِّهِ يَوْمَ لا ظِلَّ إِلاَّ ظِلُّهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الشهادات",
      "bookNumber": 5,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-5-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ، وَفِي كُلٍّ خَيْرٌ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الإيمان",
      "bookNumber": 5,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-6-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ وَهُوَ يَعِظُهُ: يَا غُلامُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 6,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-6-2",
      "arabicText": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَجُلاً جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: يَا رَسُولَ اللَّهِ، أَيُّ النَّاسِ أَحَبُّ إِلَى اللَّهِ؟ قَالَ: أَتْقَاهُمْ لِلشَهْوَ أَنْ يَقَعَ فِيهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الرقائق",
      "bookNumber": 6,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-7-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ فَلْيَغْسِلْ يَدَهُ قَبْلَ أَنْ يُدْخِلَهَا فِي وَضُوئِهِ، فَإِنَّ أَحَدَكُمْ لا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 7,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-7-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ الصَّلاةَ وَالْقِنَابِلَ صَلَّى قَبْلَكُمْ وَبَعْدَكُمْ، وَلَمْ يَمُتْ إِلاَّ سَعِيدًا.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 7,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-8-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ: إِذَا صَلَّى أَحَدُكُمْ فَلْيَبْدَأْ بِتَحْمِيدِ اللَّهِ ثُمَّ يَصْلُّي عَلَى النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَدْعُو بِمَا شَاءَ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصلاة",
      "bookNumber": 8,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-8-2",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: صَلاةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلاتِهِ فِي سُوقِهِ وَبَيْتِهِ بِضْعًا وَعِشْرِينَ دَرَجَةً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 8,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-9-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا صَلاةَ لِمَنْ لَمْ يَقْرَأْ بِأُمِّ الْقُرْآنِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الصفة",
      "bookNumber": 9,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-9-2",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِنَّ لِكُلِّ نَبِيٍّ حَرِيمًا، وَإِنَّ حَرِيمِي الصَّلاةُ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفضائل",
      "bookNumber": 9,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-10-1",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنَ النَّاسِ: الصِّحَّةُ وَالْفَرَاغُ.",
      "narrator": "عبدالله بن عباس",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 10,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-10-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَا مِنْ شَيْءٍ يُوضَعُ فِي الْمِيزَانِ أَثْقَلُ مِنْ حُسْنِ الْخُلُقِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأدب",
      "bookNumber": 10,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-11-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِيمَانِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-11-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: أَلا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ؟ قَالُوا: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ، وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ، وَانْتِظَارُ الصَّلاةِ بَعْدَ الصَّلاةِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الطهارة",
      "bookNumber": 11,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-12-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءِ ثُمَّ قَالَ: أَشْهَدُ أَنْ لا إِلَهَ إِلاَّ اللَّهُ، فُتِحَ لَهُ الْجَنَّةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الأيمان",
      "bookNumber": 12,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-12-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: اجْعَلُوا مِنْ صَلَاتِكُمْ فِي بُيُوتِكُمْ، وَلا تَتَّخِذُوهَا قُبُورًا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الفرائض",
      "bookNumber": 12,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-13-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَلَّى صَلاةً فِي مَسْجِدِي هَذَا وَأَقَامَ فَإِنَّ لَهُ أَجْرًا كَامِلاً.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 13,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-13-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: بُنِيَتِ الْمَسَاجِدُ عَلَى تَقْوَى اللَّهِ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "المساجد",
      "bookNumber": 13,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-14-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنِ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ، ثُمَّ رَاحَ، فَكَأَنَّمَا قَرَّبَ بَدَنَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ، فَكَأَنَّمَا قَرَّبَ بَقَرَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ، فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ، وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ، فَكَأَنَّمَا قَرَّبَ دَجَاجَةً، وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ، فَكَأَنَّمَا قَرَّبَ بَيْضَةً، فَإِذَا خَرَجَ الإِمَامُ حَضَرَتِ الصَّلاةُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 14,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-14-2",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَغْتَسِلُ رَجُلٌ يَوْمَ الْجُمُعَةِ، وَيَتَطَهَّرُ مَا اسْتَطَاعَ مِنْ طُهْرٍ، وَيَدَّهِنُ مِنْ دُهْنِهِ، أَوْ يَمَسُّ مِنْ طِيبِ بَيْتِهِ، ثُمَّ يَخْرُجُ فَلا يُفَرِّقُ بَيْنَ اثْنَيْنِ، إِلاَّ غُفِرَ لَهُ مَا بَيْنَهُمَا.",
      "narrator": "سلمان بن عمرو",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "الجمعة",
      "bookNumber": 14,
      "hadithNumber": 2,
      "collection": "bukhari"
    },
    {
      "id": "bukhari-15-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لَوْ يَعْلَمُ النَّاسُ مَا فِي النَّدْاءِ وَالصَّفِّ الأَوَّلِ، ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاسْتَهَمُوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Al-Bukhari",
      "chapter": "اللباس",
      "bookNumber": 15,
      "hadithNumber": 1,
      "collection": "bukhari"
    },
    {
      "id": "muslim-1-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ، وَالْمُؤْمِنُ مَنْ أَمِنَ النَّاسُ جَنَاحُهُ وَمَالُهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-1-2",
      "arabicText": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَلِكُلِّ امْرِئٍ مَا نَوَى.",
      "narrator": "عمر بن الخطاب",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-1-3",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ: الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 1,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 2,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-2",
      "arabicText": "عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ مَاتَ مِنْ أُمَّتِي مِنْ أَهْلِ الْكِتَابِ فَلَهُ الْجَنَّةُ.",
      "narrator": "جابر بن عبد الله",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 2,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-2-3",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 2,
      "hadithNumber": 3,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-1",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَحَبَّ أَعْمَالَكُمْ إِلَى اللَّهِ كَانَ أَعَظَمُكُمْ عِنْدَ اللَّهِ شَأْنًا.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الزهد",
      "bookNumber": 3,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-3-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَزَالُ لِسَانُكَ رَطْبًا مِنَ الذِّكْرِ مَا لَمْ تُكَلِّمْهُ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الذكر",
      "bookNumber": 3,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-4-1",
      "arabicText": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِلنَّاسِ مَا يُحِبُّ لِنَفْسِهِ.",
      "narrator": "أنس بن مالك",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-4-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 4,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-5-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الطُّهُورُ شَطْرُ الإِسْلامِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الطهارة",
      "bookNumber": 5,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-5-2",
      "arabicText": "عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: خَمْسٌ مِنْ فِطْرَةِ الإِسْلامِ: الْوُضُوءُ، وَالصَّلاةُ، وَالزَّكَاةُ، وَالْحَجُّ، وَصَوْمُ رَمَضَانَ.",
      "narrator": "عائشة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الإيمان",
      "bookNumber": 5,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-6-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: إِذَا نَادَى الْمُنَادِي يَوْمَ الْجُمُعَةِ فَاسْتَمِعُوا وَأَنْصِتُوا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجمعة",
      "bookNumber": 6,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-6-2",
      "arabicText": "عَنْ سَلْمَانَ الْفَارِسِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: الصَّلاةُ وَاجِبَةٌ عَلَى كُلِّ مُسْلِمٍ فِي جَمَاعَةٍ إِلاَّ أَرْبَعَةً: مَرِيضٍ، وَمُسَافِرٍ، وَعَبْدٍ، وَامْرَأَةً.",
      "narrator": "سلمان الفارسي",
      "sourceBook": "Sahih Muslim",
      "chapter": "المساجد",
      "bookNumber": 6,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-7-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يَجْمَعُ بَيْنَ الْمَرْأَةِ وَعَمَّتِهَا، وَلا بَيْنَ الْمَرْأَةِ وَخَالَتِهَا.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 7,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-7-2",
      "arabicText": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: لا يُنْكِحُ الْعَاقِدُ عَلَى نِكَاحِ، وَلا يَخْطُبُ عَلَى خِطْبَةِ أَخِيهِ.",
      "narrator": "عبدالله بن عمر",
      "sourceBook": "Sahih Muslim",
      "chapter": "النكاح",
      "bookNumber": 7,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-8-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ أَصْبَحَ صَبَاحًا فِي سَبِيلِ اللَّهِ ثَبَتَ اللَّهُ لَهُ مَعَهُ نَهَرًا فِي الْجَنَّةِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجهاد",
      "bookNumber": 8,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-8-2",
      "arabicText": "عَنْ أَبِي مُوسَى الأَشْعَرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: سُئِلَ النَّبِيُّ صلى الله عليه وسلم: أَيُّ النَّاسِ أَفْضَلُ؟ قَالَ: مَنْ يُسَلِّمُ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ.",
      "narrator": "أبو موسى الأشعري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الفضائل",
      "bookNumber": 8,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-9-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: ابْغُونِي فِي الضُّعَفَاءِ، فَإِنَّمَا تُرْزَقُونَ وَتُنْصَرُونَ بِضُعَفَائِكُمْ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 9,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-9-2",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهِ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: فِي الْجَنَّةِ مَا لا عَيْنٌ رَأَتْ، وَلا أُذُنٌ سَمِعَتْ، وَلا خَطَرَ عَلَى قَلْبِ بَشَرٍ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الجنة",
      "bookNumber": 9,
      "hadithNumber": 2,
      "collection": "muslim"
    },
    {
      "id": "muslim-10-1",
      "arabicText": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.",
      "narrator": "أبو هريرة",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 10,
      "hadithNumber": 1,
      "collection": "muslim"
    },
    {
      "id": "muslim-10-2",
      "arabicText": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ سَبْعِينَ خَرِيفًا.",
      "narrator": "أبو سعيد الخدري",
      "sourceBook": "Sahih Muslim",
      "chapter": "الصيام",
      "bookNumber": 10,
      "hadithNumber": 2,
      "collection": "muslim"
    }
  ]
}